#include "breath.h"

/*********************************************************
 *函 数 名：Breath_Init
 *函数功能：呼吸灯初始化
 *参    数：None
 *返 回 值：None
 *备    注：LED3---PC6---TIM3_CH1
 **********************************************************/
void Breath_Init(void)
{
    RCC->AHB1ENR |= (1 << 2); // GPIO时钟使能
    RCC->APB1ENR |= (1 << 1); // TIM3时钟使能
    /*GPIO配置*/
    GPIOC->MODER &= ~(3 << 12); // 复用输出
    GPIOC->MODER |= (2 << 12);
    GPIOC->OTYPER &= ~(1 << 6);
    GPIOC->OSPEEDR &= ~(3 << 12);
    GPIOC->PUPDR &= ~(3 << 12);
    GPIOC->AFR[0] &= ~(0xf << 24);
    GPIOC->AFR[0] |= (2 << 24);

    /*定时器基本配置*/
    // CR1:
    TIM3->CR1 |= (1 << 7);  // 预装载
    TIM3->CR1 &= ~(1 << 4); // 计数方式(向上)
    TIM3->CR1 &= ~(1 << 3); // 单脉冲（关）
    TIM3->CR1 &= ~(1 << 2);
    TIM3->CR1 &= ~(1 << 1);

    /*输出通道配置*/
    // SMCR:
    TIM3->SMCR &= ~(7 << 0); // 内部时钟
    // CCMR1:
    TIM3->CCMR1 &= ~(7 << 4);
    TIM3->CCMR1 |= (6 << 4);  // PWM模式1
    TIM3->CCMR1 |= (1 << 3);  // 比较寄存器预装载使能
    TIM3->CCMR1 &= ~(3 << 0); // 通道方向
    // CCER:
    TIM3->CCER |= (1 << 1); // 有效电平(低电平)

    TIM3->PSC = 84 - 1; // 计一个数1us
    TIM3->ARR = 1001 - 1;
    TIM3->CCR1 = 0;

    TIM3->EGR |= (1 << 0); // 手动产生更新事件
    TIM3->SR &= ~(1 << 0);

    TIM3->CCER |= (1 << 0); // 使能通道
    TIM3->CR1 |= (1 << 0);  // 定时器使能
}

/*********************************************************
 *函 数 名：Right_Set
 *函数功能：灯亮度调节
 *参    数：u8 right
 *返 回 值：None
 *备    注：right 0~100
 **********************************************************/
void Light_Set(u8 right)
{
    TIM3->CCR1 = right * 10;
}
