#include "rgb.h"

/*********************************************************
*函 数 名：RGB_Init
*函数功能：RGB初始化
*参    数：None
*返 回 值：None
*备    注：R---PD12--TIM4_CH1
		   G---PD13--TIM4_CH2
		   B---PD14--TIM4_CH3
**********************************************************/
void RGB_Init(void)
{
	RCC->AHB1ENR |= (1 << 3);//GPIO时钟使能
	RCC->APB1ENR |= (1 << 2);//TIM4时钟使能
	/*GPIO配置*/
	GPIOD->MODER &= ~((3 << 24) | (3 << 26) | (3 << 28));	//复用输出
	GPIOD->MODER |= ((2 << 24) | (2 << 26) | (2 << 28));
	GPIOD->OTYPER &= ~((1 << 12) | (1 << 13) | (1 << 14));
	GPIOD->OSPEEDR &= ~((3 << 24) | (3 << 26) | (3 << 28));
	GPIOD->PUPDR &= ~((3 << 24) | (3 << 26) | (3 << 28));
	GPIOD->AFR[1] &= ~((0xf << 16) | (0xf << 20) | (0xf << 24));
	GPIOD->AFR[1] |= ((2 << 16) | (2 << 20) | (2 << 24));

	/*定时器基本配置*/
	//CR1:
	TIM4->CR1 |= (1 << 7);//预装载
	TIM4->CR1 &= ~(1 << 4);//计数方式(向上)
	TIM4->CR1 &= ~(1 << 3);//单脉冲（关）
	TIM4->CR1 &= ~(1 << 2);
	TIM4->CR1 &= ~(1 << 1);

	/*通道1*/
	//SMCR: 
	TIM4->SMCR &= ~(7 << 0);//内部时钟
	//CCMR1:
	TIM4->CCMR1 &= ~(7 << 4);
	TIM4->CCMR1 |= (6 << 4);//PWM模式1
	TIM4->CCMR1 |= (1 << 3);//比较寄存器预装载使能
	TIM4->CCMR1 &= ~(3 << 0);//通道方向   
	//CCER:
	TIM4->CCER |= (1 << 1);//有效电平(低电平)
	TIM4->CCR1 = 0;

	/*通道2*/
	//CCMR1:
	TIM4->CCMR1 &= ~(7 << 12);
	TIM4->CCMR1 |= (6 << 12);//PWM模式1
	TIM4->CCMR1 |= (1 << 11);//比较寄存器预装载使能
	TIM4->CCMR1 &= ~(3 << 8);//通道方向   
	//CCER:
	TIM4->CCER |= (1 << 5);//有效电平(低电平)
	TIM4->CCR2 = 0;

	/*通道3*/
	//CCMR1:
	TIM4->CCMR2 &= ~(7 << 4);
	TIM4->CCMR2 |= (6 << 4);//PWM模式1
	TIM4->CCMR2 |= (1 << 3);//比较寄存器预装载使能
	TIM4->CCMR2 &= ~(3 << 0);//通道方向   
	//CCER:
	TIM4->CCER |= (1 << 9);//有效电平(高电平)
	TIM4->CCR3 = 0;


	TIM4->PSC = 84 - 1;//计一个数10us
	TIM4->ARR = 256 - 1;//计数周期20ms

	TIM4->EGR |= (1 << 0);//手动产生更新事件
	TIM4->SR &= ~(1 << 0);

	TIM4->CCER |= (1 << 0);//使能通道1
	TIM4->CCER |= (1 << 4);//使能通道2
	TIM4->CCER |= (1 << 8);//使能通道2

	TIM4->CR1 |= (1 << 0);//定时器使能
}

/*********************************************************
*函 数 名：RGB_SetColor
*函数功能：颜色改变
*参    数：u8 R,u8 G,u8 B   范围：0~255
*返 回 值：None
*备    注：
**********************************************************/
void RGB_SetColor(u8 R, u8 G, u8 B)
{
	TIM4->CCR1 = R;//红色
	TIM4->CCR2 = G;//绿色
	TIM4->CCR3 = B;//蓝色

}
