#include "tim11.h"

/*********************************************************
*函 数 名：TIM11_Delay_ms
*函数功能：TIM11毫秒级延时
*参    数：要延时的时间
*返 回 值：None
*备    注：
**********************************************************/
void TIM11_Delay_ms(u32 xms)
{
	RCC->APB2ENR |= (1 << 18);
	//CR1
	TIM11->CR1 |= (1 << 7);//开启预装载功能（影子寄存器）
	TIM11->CR1 &= ~(1 << 2);//更新中断触发途径
	TIM11->CR1 &= ~(1 << 1);//是否产生更新事件（是）
	//填入分频值
	TIM11->PSC = 1680 - 1;//计一个数为10us
	//填入重装载值
	TIM11->ARR = 100 * xms - 1;

	//手动产生更新事件
	TIM11->EGR |= (1 << 0);
	//清除UIF(更新事件）标志位
	TIM11->SR &= ~(1 << 0);
	//使能定时器
	TIM11->CR1 |= (1 << 0);
	while (!(TIM11->SR&(1 << 0)));
	TIM11->CR1 &= ~(1 << 0);

}











