#include "tim6.h"

/*********************************************************
*函 数 名：TIM6_Delay_us
*函数功能：TIM6微秒级延时
*参    数：要延时的时间
*返 回 值：None
*备    注：
**********************************************************/
void TIM6_Delay_us(u32 xus)
{
	//定时器时钟使能
	RCC->APB1ENR |= (1 << 4);
	//CR1
	TIM6->CR1 |= (1 << 7);//开启预装载功能（影子寄存器）
	TIM6->CR1 |= (1 << 3);//开启单脉冲模式
	TIM6->CR1 &= ~(1 << 2);//更新中断触发途径
	TIM6->CR1 &= ~(1 << 1);//是否产生更新事件（是）
	//填入分频值
	TIM6->PSC = 42 - 1;//计一个数为0.5us
	//填入重装载值
	TIM6->ARR = 2 * xus - 1;
	//手动产生更新事件
	TIM6->EGR |= (1 << 0);
	//清除UIF(更新事件）标志位
	TIM6->SR &= ~(1 << 0);
	//使能定时器
	TIM6->CR1 |= (1 << 0);
	//等待状态寄存器的UIF(更新事件）位置1
	while (!(TIM6->SR&(1 << 0)));
}


/*********************************************************
*函 数 名：TIM6_Delay_ms
*函数功能：TIM6微秒级延时
*参    数：要延时的时间
*返 回 值：None
*备    注：
**********************************************************/
void TIM6_Delay_ms(u32 xms)
{
	//定时器时钟使能
	RCC->APB1ENR |= (1 << 4);
	//CR1
	TIM6->CR1 |= (1 << 7);//开启预装载功能（影子寄存器）
	TIM6->CR1 |= (1 << 3);//开启单脉冲模式
	TIM6->CR1 &= ~(1 << 2);//更新中断触发途径
	TIM6->CR1 &= ~(1 << 1);//是否产生更新事件（是）
	//填入分频值
	TIM6->PSC = 8400 - 1;//计一个数为100us
	//填入重装载值
	TIM6->ARR = 10 * xms - 1;
	//手动产生更新事件
	TIM6->EGR |= (1 << 0);
	//清除UIF(更新事件）标志位
	TIM6->SR &= ~(1 << 0);
	//使能定时器
	TIM6->CR1 |= (1 << 0);
	//等待状态寄存器的UIF(更新事件）位置1
	while (!(TIM6->SR&(1 << 0)));
}









